<template>
  <div>
    <section class="section-tertiary ">
      <div class="container ">
        <h1>关于</h1>
        <center>
          <h4>CJ OJ是一个全新的OJ框架，实现了全数据集，单数据集和带权重单数据集多种评判模式.</h4>
        </center>
        <br>
        <h2>项目特色与创新点</h2>
        <h3>系统地研究程序正确性在线评判模式</h3>
        <p>
          目前，全数据集评判模式应用较广，单数据集评判模式应用较少，带权重单数据集鲜有研究。本项目拟系统地研究这三种评判模式的特点和实现方式。
        </p>
        <h3>在OJ系统中实现全数据集、单数据集、带权重单数据集三种评判模式</h3>
        <p>
          目前，大部分在线评判（Online Judge, OJ）系统实现的是全数据集评判模式，蓝桥杯大赛练习系统等实现的是单数据集评判模式，目前国内尚无实现多种评判模式的OJ系统。本项目拟在OJ系统中实现全数据集、单数据集、带权重单数据集三种评判模式。
        </p>
        <h3>CJ OJ系统能适应不同应用需求</h3>
        <p>
          目前，各类程序设计类学科竞赛在国内高校日益推广，参赛面和影响力越来越大，急需一种能适应采用不同评判模式的程序设计竞赛的OJ系统；此外，传统的编程实践需要人工评判，这种实践方式评判不及时、主观性强，学生难以及时发现程序中的问题，老师也难以及时检验学生的学习效果，OJ系统能改变传统编程实践形式落后的现状。本项目拟开发OJ系统能适应上述不同需求，具有较广的应用前景。
        </p>

      </div>
    </section>
  </div>
</template>

<script>
export default {}
</script>

<style lang="scss" scoped>
.about_wrapper {
  padding: 20px;
}
</style>
